# set up brew cask
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# brew installs
brew "fish"
brew "fisher"
brew "ripgrep"
brew "git"
brew "mas"
brew "python"
brew "node"
brew "nvm"
brew "yarn"
brew "neovim"
brew "exa"
brew "ghq"
brew "peco"

# brew cask install dev-tools
cask "iterm2"
cask "postman"
cask "sourcetree"
cask "alfred"
cask "spectacle"

# brew cask install apps
cask "tunnelbear"
cask "notion"
cask "slack"

# brew cask install browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# brew cask install drivers
# cask "logitech-options"

# brew cask install fonts
cask "font-fira-code"
cask "font-hack-nerd-font"

# Mac Appstore
mas "Xcode", id: 497799835
mas "KakaoTalk", id: 869223134
mas "Xnip", id: 1221250572 
