# set up brew cask
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/drivers"

# brew installs
brew "zsh"
brew "git"
brew "mas"
brew "sqlite"
brew "wget"
brew "python"
brew "node"
brew "yarn"
brew "task"

# brew cask install dev-tools
cask "iterm2"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "alfred"
cask "spectacle"

# brew cask install apps
cask "tunnelbear"
cask "notion"
cask "slack"

# brew cask install browsers
cask "google-chrome"

# brew cask install drivers
# cask "logitech-options"

# brew cask install fonts
cask "font-fira-code"

# Mac Appstore
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "KakaoTalk", id: 869223134
mas "Snappy", id: 512617038
